<?php

use yii\db\Migration;

/**
 * Class m200219_080609_insert_category_state_city
 */
class m200219_080609_insert_state_city extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->insert('state', ['id' => 1, 'name' => 'آذربایجان شرقی']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['اسکو', 1], ['اهر', 1], ['ایلخچی', 1], ['آبش احمد', 1], ['آذرشهر', 1], ['آقکند', 1], ['باسمنج', 1], ['بخشایش', 1], ['بستان آباد', 1],
                ['بناب', 1], ['بناب  جدید', 1], ['تبریز', 1], ['ترک', 1], ['ترکمانچای', 1], ['تسوج', 1], ['تیکمه داش', 1], ['جلفا', 1], ['خاروانا', 1],
                ['خامنه', 1], ['خراجو', 1], ['خسروشهر', 1], ['خمارلو', 1], ['خواجه', 1], ['دوزدوزان', 1], ['زرنق', 1], ['زنوز', 1], ['سراب', 1],
                ['سردرود', 1], ['سیس', 1], ['سیه رود', 1], ['شبستر', 1], ['شربیان', 1], ['شرفخانه', 1], ['شندآباد', 1], ['شهر جدید  سهند', 1],
                ['صوفیان', 1], ['عجب شیر', 1], ['قره آغاج', 1], ['کشکسرای', 1], ['کلوانق', 1], ['کلیبر', 1], ['کوزه کنان', 1], ['گوگان', 1], ['لیلان', 1],
                ['مراغه', 1], ['مرند', 1], ['ملکان', 1], ['ممقان', 1], ['مهربان', 1], ['میانه', 1], ['نظرکهریزی', 1], ['وایقان', 1], ['ورزقان', 1], ['هادیشهر', 1],
                ['هریس', 1], ['هشترود', 1], ['هوراند', 1], ['یامچی', 1]
            ]);

        $this->insert('state', ['id' => 2, 'name' => 'آذربایجان غربی']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ارومیه', 2], ['اشنویه', 2], ['ایواوغلی', 2], ['آواجیق', 2], ['باروق', 2], ['بازرگان', 2], ['بوکان', 2], ['پلدشت', 2], ['پیرانشهر', 2],
                ['تازه شهر', 2], ['تکاب', 2], ['چهاربرج', 2], ['خلیفان', 2], ['خوی', 2], ['دیزج دیز', 2], ['ربط', 2], ['سردشت', 2], ['سرو', 2],
                ['سلماس', 2], ['سیلوانه', 2], ['سیمینه', 2], ['سیه چشمه', 2], ['شاهین دژ', 2], ['شوط', 2], ['فیرورق', 2], ['قره ضیاءالدین', 2],
                ['قطور', 2], ['قوشچی', 2], ['کشاورز', 2], ['گردکشانه', 2], ['ماکو', 2], ['محمدیار', 2], ['محمودآباد', 2], ['مهاباد', 2], ['میاندوآب', 2],
                ['میرآباد', 2], ['نالوس', 2], ['نقده', 2], ['نوشین', 2],
            ]);

        $this->insert('state', ['id' => 3, 'name' => 'اردبیل']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['اردبیل', 3], ['اصلاندوز', 3], ['آبیبیگلو', 3], ['بیله سوار', 3], ['پارس آباد', 3], ['تازه کند', 3], ['تازه  کندانگوت', 3], ['جعفرآباد', 3], ['خلخال', 3],
                ['رضی', 3], ['سرعین', 3], ['عنبران', 3], ['فخرآباد', 3], ['کلور', 3], ['کوراییم', 3], ['گرمی', 3], ['گیوی', 3], ['لاهرود', 3], ['مرادلو', 3],
                ['مشگین شهر', 3], ['نمین', 3], ['نیر', 3], ['هشتجین', 3], ['هیر', 3],
            ]);

        $this->insert('state', ['id' => 4, 'name' => 'اصفهان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ابریشم', 4], ['ابوزید آباد', 4], ['اردستان', 4], ['اژیه', 4], ['اصفهان', 4], ['افوس', 4], ['انارک', 4], ['ایمانشهر', 4], ['آران و بیدگل', 4],
                ['بادرود', 4], ['باغ  بهادران', 4], ['بافران', 4], ['برزک', 4], ['برف انبار', 4], ['بوئين  و  مياندشت', 4], ['بهاران شهر', 4], ['بهارستان', 4],
                ['پیربکران', 4], ['تودشک', 4], ['تیران', 4], ['جندق', 4], ['جوزدان', 4], ['جوشقان  و  کامو', 4], ['چادگان', 4], ['چرمهین', 4], ['چمگردان', 4],
                ['حبیب آباد', 4], ['حسن آباد', 4], ['حنا', 4], ['خالد آباد', 4], ['خمینی شهر', 4], ['خوانسار', 4], ['خور', 4], ['خوراسگان', 4], ['خورزوق', 4],
                ['داران', 4], ['دامنه', 4], ['درچه پیاز', 4], ['دستگرد', 4], ['دولت آباد', 4], ['دهاقان', 4], ['دهق', 4], ['دیزیچه', 4], ['رزوه', 4],
                ['رضوانشهر', 4], ['زاینده رود', 4], ['زرین شهر', 4], ['زواره', 4], ['زیباشهر', 4], ['سده لنجان', 4], ['سفید شهر', 4], ['سگزی', 4], ['سمیرم', 4],
                ['شاپور آباد', 4], ['شاهین شهر', 4], ['شهررضا', 4], ['طالخونچه', 4], ['عسگران', 4], ['علویچه', 4], ['فرخی', 4], ['فریدون شهر', 4], ['فلاورجان', 4],
                ['فولادشهر', 4], ['قمصر', 4], ['قهجاورستان', 4], ['قهدریجان', 4], ['کاشان', 4], ['کرکوند', 4], ['کلیشاد و  سودرجان', 4], ['کمشچه', 4],
                ['کمه', 4], ['کوشک', 4], ['کوهپایه', 4], ['کهریزسنگ', 4], ['گرگاب', 4], ['گزبرخوار', 4], ['گلپایگان', 4], ['گلدشت', 4], ['گلشن', 4],
                ['گلشهر', 4], ['گوگد', 4], ['لای  بید', 4], ['مبارکه', 4], ['محمد آباد', 4], ['مشکات', 4], ['منظریه', 4], ['مهاباد', 4], ['میمه', 4], ['نائین', 4],
                ['نجف آباد', 4], ['نصر آباد', 4], ['نطنز', 4], ['نوش آباد', 4], ['نیاسر', 4], ['نیک آباد', 4], ['وزنه', 4], ['ورنامخواست', 4], ['وزوان', 4],
                ['ونک', 4], ['هرند', 4],
            ]);

        $this->insert('state', ['id' => 5, 'name' => 'البرز']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['اشتهارد', 5], ['آسارا', 5], ['تنکمان', 5], ['چهارباغ', 5], ['سیف آباد', 5], ['شهر جدید هشتگرد', 5], ['طالقان', 5], ['کرچ', 5],
                ['کمال شهر', 5], ['کوهسار', 5], ['گرمدره', 5], ['ماهدشت', 5], ['محمدشهر', 5], ['مشکین دشت', 5], ['نظر آباد', 5],
                ['هشتگرد', 5]
            ]);

        $this->insert('state', ['id' => 6, 'name' => 'ایلام']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ارکواز', 6], ['ایلام', 6], ['ایوان', 6], ['آبدانان', 6], ['آسمان آباد', 6], ['بدره', 6], ['پهله', 6],
                ['توحید', 6], ['چوار', 6], ['دره شهر', 6], ['دل گشا', 6], ['دهلران', 6], ['زرنه', 6], ['سراب  باغ', 6],
                ['سرابله', 6], ['صالح آباد', 6], ['لومار', 6], ['مورموری', 6], ['موسیان', 6], ['مهران', 6], ['میمه', 6],
            ]);

        $this->insert('state', ['id' => 7, 'name' => 'بوشهر']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['امام حسن', 7], ['انارستان', 7], ['اهرم', 7], ['آبپخش', 7], ['آبدان', 7], ['برازجان', 7], ['بردخون', 7],
                ['بردستان', 7], ['بندردیر', 7], ['بندر دیلم', 7], ['بندر ریگ', 7], ['بندرکنگان', 7], ['بندرگناوه', 7],
                ['بنک', 7], ['بوشهر', 7], ['تنگ ارم', 7], ['جم', 7], ['چغادک', 7], ['خارک', 7], ['خورموج', 7], ['دالکی', 7],
                ['دلوار', 7], ['ریز', 7], ['سعد آباد', 7], ['سیراف', 7], ['شبانکاره', 7], ['شنبه', 7], ['عسلویه', 7], ['کاکی', 7],
                ['کلمه', 7], ['نخل تقی', 7], ['وحدتیه', 7],

            ]);

        $this->insert('state', ['id' => 8, 'name' => 'تهران']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ارجمند', 8], ['اسلام شهر', 8], ['اندیشه', 8], ['آبسرد', 8], ['آبعلی', 8], ['باغستان', 8], ['باقرشهر', 8], ['بومهن', 8],
                ['پاکدشت', 8], ['پردیس', 8], ['پیشوا', 8], ['تجریش', 8], ['تهران', 8], ['جوادآباد', 8], ['چهاردانگه', 8],
                ['حسن آباد', 8], ['دماوند', 8], ['رباط کریم', 8], ['رودهن', 8], ['ری', 8], ['شاهدشهر', 8], ['شریف آباد', 8],
                ['شهریار', 8], ['صالح آباد', 8], ['صبا شهر', 8], ['صفا دشت', 8], ['فردوسیه', 8], ['فرون آباد', 8], ['فشم', 8],
                ['فیروزکوه', 8], ['قدس', 8], ['قرچک', 8], ['کهریزک', 8], ['کیلان', 8], ['گلستان', 8], ['لواسان', 8], ['ملارد', 8],
                ['نسیم شهر', 8], ['نصیر آباد', 8], ['وحیدیه', 8], ['ورامین', 8],
            ]);

        $this->insert('state', ['id' => 9, 'name' => 'چهارمحال  و بختیاری']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['اردل', 9], ['آلونی', 9], ['بابا حیدر', 9], ['بروجن', 9], ['بلداجی', 9], ['بن', 9], ['جونقان', 9], ['چلگرد', 9],
                ['سامان', 9], ['سفید دشت', 9], ['سودجان', 9], ['سورشجان', 9], ['شلمزار', 9], ['شهرکرد', 9], ['طاقانک', 9],
                ['فارسان', 9], ['فرادنبه', 9], ['فرخ شهر', 9], ['کیان', 9], ['گندمان', 9], ['گهرو', 9],
                ['لردگان', 9], ['مال خلیفه', 9], ['ناغان', 9], ['نافچ', 9], ['نقنه', 9], ['هفشجان', 9],
            ]);

        $this->insert('state', ['id' => 10, 'name' => 'خراسان جنوبی']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ارسک', 10], ['اسدیه', 10], ['اسفدن', 10], ['اسلامیه', 10], ['آرین شهر', 10], ['آیسک', 10],
                ['بشرویه', 10], ['بیرجند', 10], ['حاجی آباد', 10], ['خضری  دشت  بیاض', 10], ['خوسف', 10], ['زهان', 10],
                ['سرایان', 10], ['سربیشه', 10], ['سه قلعه', 10], ['شوسف', 10], ['طبس مسینا', 10], ['فردوس', 10],
                ['قائن', 10], ['قهستان', 10], ['گزیک', 10], ['محمدشهر', 10], ['مود', 10], ['نهبندان', 10],
                ['نیمبلوک', 10]
            ]);

        $this->insert('state', ['id' => 11, 'name' => 'خراسان رضوی']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['احمد آباد صولت', 11], ['انابد', 11], ['باجگیران', 11], ['باخرز', 11], ['بار', 11], ['بایگ', 11],
                ['بجستان', 11], ['بردسکن', 11], ['بیدخت', 11], ['تایباد', 11], ['تربت  جام', 11], ['تربت حیدریه', 11],
                ['جغتای', 11], ['جنگل', 11], ['چاپشلو', 11], ['چکنه', 11], ['چناران', 11], ['خرو', 11],
                ['خلیل آباد', 11], ['خواف', 11], ['داورزن', 11], ['درگز', 11], ['درود', 11], ['دولت آباد', 11],
                ['رباط سنگ', 11], ['رشتخوار', 11], ['رضویه', 11], ['روداب', 11], ['ریوش', 11], ['سبزوار', 11],
                ['سرخس', 11], ['سفیدسنگ', 11], ['سلامی', 11], ['سلطان آباد', 11], ['سنگان', 11], ['شادمهر', 11],
                ['شاندیز', 11], ['ششتمد', 11], ['شهرآباد', 11], ['شهرزو', 11], ['صالح آباد', 11], ['طرقبه', 11],
                ['عشق آباد', 11], ['فرهادگرد', 11], ['فریمان', 11], ['فیروزه', 11], ['فیض آباد', 11], ['قاسم آباد', 11],
                ['قدمگاه', 11], ['قلندرآباد', 11], ['قوچان', 11], ['کاخک', 11], ['کاریز', 11], ['کاشمر', 11],
                ['کدکن', 11], ['کلات', 11], ['کندر', 11], ['گلمکان', 11], ['گناباد', 11], ['لطف آباد', 11],
                ['مزدآوند', 11], ['مشهد', 11], ['مشهدریزه', 11], ['ملک آباد', 11], ['نشتیفان', 11], ['نصرآباد', 11],
                ['نقاب', 11], ['نوخندان', 11], ['نیشابور', 11], ['نیل شهر', 11], ['همت آباد', 11], ['یونسی', 11],
            ]);

        $this->insert('state', ['id' => 12, 'name' => 'خراسان شمالی']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['اسفراین', 12], ['ایور', 12], ['آشخانه', 12], ['بجنورد', 12], ['پیش قلعه', 12], ['تیتکانلو', 12],
                ['جاجرم', 12], ['حصارگرمخان', 12], ['درق', 12], ['راز', 12], ['سنخواست', 12], ['شوقان', 12],
                ['شیروان', 12], ['صفی آباد', 12], ['فاروج', 12], ['قاضی', 12], ['گرمه', 12], ['لوجلی', 12],
            ]);

        $this->insert('state', ['id' => 13, 'name' => 'خوزستان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['اروندکنار', 13], ['الوان', 13], ['امیدیه', 13], ['اندیمشک', 13], ['اهواز', 13], ['ایذه', 13],
                ['آبادان', 13], ['آغاجاری', 13], ['باغ ملک', 13], ['بستان', 13], ['بندرامام خمینی', 13],
                ['بندر ماهشهر', 13], ['بهبان', 13], ['ترکالکی', 13], ['جایزان', 13], ['جنت مکان', 13],
                ['چغامیش', 13], ['چمران', 13], ['چوئبده', 13], ['حر', 13], ['حسینیه', 13], ['حمزه', 13],
                ['حمیدیه', 13], ['خرمشهر', 13], ['دارخوین', 13], ['دزآب', 13], ['دزفول', 13], ['دهدز', 13],
                ['رامشیر', 13], ['رامهرمز', 13], ['رفیع', 13], ['زهره', 13], ['سالند', 13], ['سردشت', 13],
                ['سماله', 13], ['سوسنگرد', 13], ['شادگان', 13], ['شاوور', 13], ['شرافت', 13], ['شوش', 13],
                ['شوشتر', 13], ['شیبان', 13], ['صالح شهر', 13], ['صالح  مشطط', 13], ['صفی آباد', 13], ['صیدون', 13],
                ['قلعه تل', 13], ['قلعه خواجه', 13], ['گتوند', 13], ['گوریه', 13], ['لالی', 13], ['مسجدسلیمان', 13],
                ['مشراگه', 13], ['مقاومت', 13], ['ملاثانی', 13], ['میانرود', 13], ['میداود', 13], ['مینوشهر', 13],
                ['ویس', 13], ['هفتگل', 13], ['هندیجان', 13], ['هویزه', 13],
            ]);

        $this->insert('state', ['id' => 14, 'name' => 'زنجان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ابهر', 14], ['ارمغانخانه', 14], [' آب بر', 14], [' چورزق', 14], ['حلب', 14], [' خرمدره', 14],
                [' دندی', 14], [' زرین آباد', 14], [' زرین رود', 14], [' زنجان', 14], ['سجاس', 14], ['سلطانیه', 14],
                [' سهرورد', 14], [' صائین قلعه', 14], [' قیدار', 14], ['گرماب', 14], [' ماه نشان', 14], ['هیدج', 14],
            ]);

        $this->insert('state', ['id' => 15, 'name' => 'سمنان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['امیریه', 15], ['ایوانکی', 15], ['آرادان', 15], ['بسطام', 15], ['بیارجمند', 15], ['دامغان', 15],
                ['درجزین', 15], ['دیباج', 15], ['سرخه', 15], ['سمنان', 15], ['شاهرود', 15], ['شهمیرزاد', 15],
                ['کلاته  خیج', 15], ['گرمسار', 15], ['مجن', 15], [' مهدی شهر', 15], ['میامی', 15],
            ]);

        $this->insert('state', ['id' => 16, 'name' => 'سیستان  و بلوچستان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ادیمی', 16], ['اسپکه', 16], ['ایرانشهر', 16], ['بزمان', 16], ['بمپور', 16], ['بنت', 16],
                ['بنجار', 16], ['پیشین', 16], ['جالق', 16], ['چاه بهار', 16], ['خاش', 16], ['دوست محمد', 16],
                ['راسک', 16], ['زابل', 16], ['زابلی', 16], ['زاهدان', 16], ['زرآباد', 16], ['زهک', 16],
                ['سراوان', 16], ['سرباز', 16], ['سوران', 16], ['سیرکان', 16], ['علی اکبر', 16], ['فنوج', 16],
                ['قصر قند', 16], ['کنارک', 16], ['گشت', 16], ['گلمورتی', 16], ['محمدان', 16], ['محمد آباد', 16],
                ['محمدی', 16], ['میرجاوه', 16], ['نصرت آباد', 16], ['نگور', 16], ['نوک آباد', 16], ['نیک شهر', 16],
                ['هیدوج', 16],
            ]);

        $this->insert('state', ['id' => 17, 'name' => 'فارس']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['اردکان', 17], ['ارسنجان', 17], ['استهبان', 17], ['اسیر', 17], ['اشکنان', 17], ['افزر', 17],
                ['اقلید', 17], ['امام شهر', 17], ['اوز', 17], ['اهل', 17], ['ایج', 17], ['ایزدخواست', 17],
                ['آباده', 17], ['آباده  طشک', 17], ['باب انار', 17], ['بالاده', 17], ['بنارویه', 17], ['بوانات', 17],
                ['بهمن', 17], ['بیرم', 17], ['بیضا', 17], ['جنت شهر', 17], ['جویم', 17], ['جهرم', 17],
                ['حاجی آباد', 17], ['حسامی', 17], ['حسن آباد', 17], ['خانه  زنیان', 17], ['خاوران', 17], ['خرامه', 17],
                ['خشت', 17], ['خنج', 17], ['خور', 17], ['خومه زار', 17], ['داراب', 17], ['داریان', 17],
                ['دبیران', 17], ['دژکرد', 17], ['دوبرجی', 17], ['دوزه', 17], ['دهرم', 17], ['رامجرد', 17],
                ['رونیز', 17], ['زاهدشهر', 17], ['زرقان', 17], ['سده', 17], ['سروستان', 17], ['سعادت شهر', 17],
                ['سورمق', 17], ['سیدان', 17], ['ششده', 17], ['شهر  جدید صدرا', 17], ['شهرپیر', 17], ['شیراز', 17],
                ['صغاد', 17], ['صفادشت', 17], ['علامرودشت', 17], ['عمادده', 17], ['فدامی', 17], ['فراشبند', 17],
                ['فسا', 17], ['فیروزآباد', 17], ['قادرآباد', 17], ['قائمیه', 17], ['قطب آباد', 17], ['قطرویه', 17],
                ['قیر', 17], ['کارزین', 17], ['کازرون', 17], ['کامفیروز', 17], ['کره ای', 17], ['کنارتخته', 17],
                ['کوار', 17], ['کوهنجان', 17], ['گراش', 17], ['گله دار', 17], ['لار', 17], ['لامرد', 17],
                ['لپوئی', 17], ['لطیفی', 17], ['مبارک آباد', 17], ['مرودشت', 17], ['مشکان', 17], ['مصیری', 17],
                ['مهر', 17], ['میمند', 17], ['نوبندگان', 17], ['نوجین', 17], ['نودان', 17], ['نورآباد', 17],
                ['نی ریز', 17], ['وراوی', 17], ['هماشهر', 17]
            ]);


        $this->insert('state', ['id' => 18, 'name' => 'قزوین']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ارداق', 18], ['اسفرورین', 18], ['اقبالیه', 18], ['الوند', 18], ['آبگرم', 18], ['آبیک', 18], ['آوج', 18],
                ['بوئین زهرا', 18], ['بیدستان', 18], ['تاکستان', 18], ['خاکعلی', 18], ['خرمدشت', 18], ['دانسفهان', 18],
                ['رازمیان', 18], ['سگزآباد', 18], ['سیردان', 18], ['شال', 18], ['شریفیه', 18], ['ضیاءآباد', 18], ['قزوین', 18],
                ['کوهین', 18], ['محمدیه', 18], ['محمودآباد نمونه', 18], [' معلم کلایه', 18], [' نرجه', 18],
            ]);

        $this->insert('state', ['id' => 19, 'name' => 'قم']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['جعفریه', 19], ['دستجرد', 19], ['سلفچگان', 19], ['قم', 19], ['قنوات', 19], ['کهک', 19],
            ]);

        $this->insert('state', ['id' => 20, 'name' => 'کردستان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['آرمرده', 20], ['بابارشانی', 20], ['بانه', 20], ['بلبان آباد', 20], ['بوئین سفلی', 20], ['بیجار', 20], ['چناره', 20], ['دزج', 20],
                ['دلبران', 20], ['دهگلان', 20], ['دیواندره', 20], ['زرینه', 20], ['سرو آباد', 20],
                ['سریش آباد', 20], ['سقز', 20], ['سنندج', 20], ['شویشه', 20], ['صاحب', 20],
                ['قروه', 20], ['کامیاران', 20], ['کانی دینار', 20], ['کانی سور', 20], ['مریوان', 20],
                ['موچش', 20], ['یاسوکند', 20],
            ]);

        $this->insert('state', ['id' => 21, 'name' => 'کرمان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['اختیارآباد', 21], ['ارزوئیه', 21], ['امین شهر', 21], ['انار', 21], ['اندوهجرد', 21],
                ['باغین', 21], ['بافت', 21], ['بردسیر', 21], ['بروات', 21], ['بزنجان', 21],
                ['بم', 21], ['بهرمان', 21], ['پاریز', 21], ['جبالبارز', 21], ['جوپار', 21], ['جوزم', 21],
                ['جیرفت', 21], ['چترود', 21], ['خاتون آباد', 21], ['خانوک', 21], ['خورسند', 21],
                ['درب بهشت', 21], ['دوساری', 21], ['دهج', 21], ['رابر', 21], ['راور', 21], ['راین', 21],
                ['رفسنجان', 21], ['رودبار', 21], ['ریحان شهر', 21], ['زرند', 21], ['زنگی آباد', 21],
                ['زید آباد', 21], ['سر چشمه', 21], ['سیرجان', 21], ['شهداد', 21], ['شهر بابک', 21],
                ['صفائیه', 21], ['عنبر آباد', 21], ['فاریاب', 21], ['فهوج', 21], ['قلعه گنج', 21],
                ['کاظم آباد', 21], ['کرمان', 21], ['کشکوئیه', 21], ['کوهبنان', 21], ['کهنوج', 21],
                ['کیانشهر', 21], ['گلباف', 21], ['گلزار', 21], ['لاله زار', 21], ['ماهان', 21],
                ['محمدآباد', 21], ['محی آباد', 21], ['مردهک', 21], ['منوجان', 21], ['نجف شهر', 21],
                ['نرماشیر', 21], ['نظام شهر', 21], ['نگار', 21], ['نودژ', 21], ['هجدک', 21], ['هما شهر', 21],
                ['یزدان شهر', 21],
            ]);

        $this->insert('state', ['id' => 22, 'name' => 'کرمانشاه']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ازگله', 22], ['اسلام آبادغرب', 22], ['باینگان', 22], ['بیستون', 22], ['پاوه', 22],
                ['تازه آباد', 22], ['جوانرود', 22], ['حمیل', 22], ['رباط', 22], ['روانسر', 22],
                ['سرپل ذهاب', 22], ['سرمست', 22], ['سطر', 22], ['سنقر', 22], ['سومار', 22],
                ['شاهو', 22], ['صحنه', 22], ['قصرشیرین', 22], ['کرمانشاه', 22], ['کرند غرب', 22],
                ['کنگاور', 22], ['کوزران', 22], ['گهواره', 22], ['گیلانغرب', 22], ['میان راهان', 22],
                ['نودشه', 22], ['نوسود', 22], ['هرسین', 22], ['هلشی', 22],
            ]);

        $this->insert('state', ['id' => 23, 'name' => 'کهگیلویه  و بویراحمد']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['باشت', 23], ['پاتاوه', 23], ['چرام', 23], ['چیتاب', 23], ['دوگنبدان', 23],
                ['دهدشت', 23], ['دیشموک', 23], ['سوق', 23], ['سی سخت', 23], ['قلعه رئیسی', 23],
                ['گراب سفلی', 23], ['لنده', 23], ['لیکک', 23], ['مادوان', 23], ['مارگون', 23],
                ['یاسوج', 23],
            ]);

        $this->insert('state', ['id' => 24, 'name' => 'گلستان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['انبارآلوم', 24], ['اینچه برون', 24], ['آزادشهر', 24], ['آق قلا', 24], ['بندرگز', 24],
                ['ترکمن', 24], ['جلین', 24], ['خان ببین', 24], ['دلند', 24], ['رامیان', 24],
                ['سرخنکلاته', 24], ['سیمین شهر', 24], ['علی آباد', 24], ['فاضل آباد', 24],
                ['کردکوی', 24], ['کلاله', 24], ['گالکیش', 24], ['گرگان', 24], ['گمیش تپه', 24],
                ['گنبد کاووس', 24], ['مراوه تپه', 24], ['مینو دشت', 24], ['نگین شهر', 24],
                ['نوده خاندوز', 24], ['نوکنده', 24]
            ]);

        $this->insert('state', ['id' => 25, 'name' => 'گیلان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['احمدسرگوراب', 25], ['اسالم', 25], ['اطاقور', 25], ['املش', 25], ['آستارا', 25],
                ['آستانه اشرفیه', 25], ['بازارجمعه', 25], ['بره سر', 25], ['بندرانزلی', 25],
                ['پره سر', 25], ['توتکابن', 25], ['جیرنده', 25], ['چابکسر', 25], ['چاف  و چمخاله', 25],
                ['چوبر', 25], ['حویق', 25], ['خشکبیجار', 25], ['خمام', 25], ['دیلمان', 25],
                ['رانکوه', 25], ['رحیم آباد', 25], ['رستم آباد', 25], ['رشت', 25], ['رضوانشهر', 25],
                ['رودبار', 25], ['رودبنه', 25], ['رودسر', 25], ['سنگر', 25], ['سیاهکل', 25],
                ['شفت', 25], ['شلمان', 25], ['صومعه سرا', 25], ['فومن', 25], ['کلاچای', 25],
                ['کوچصفهان', 25], ['کومله', 25], ['کیاشهر', 25], ['گوراب زرمیخ', 25],
                ['لاهیجان', 25], ['لشت نشاء', 25], ['لنگرود', 25], ['لوشان', 25], ['لولمان', 25],
                ['لوندویل', 25], ['لیسار', 25], ['ماسال', 25], ['ماسوله', 25], ['مرجقل', 25],
                ['منجیل', 25], ['واجارگاه', 25], ['هشتپر', 25],
            ]);

        $this->insert('state', ['id' => 26, 'name' => 'لرستان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ازنا', 26], ['اشترینان', 26], ['الشتر', 26], ['الیگودرز', 26], ['بروجرد', 26],
                ['پلدختر', 26], ['چالانچولان', 26], ['چغلوندی', 26], ['چقابل', 26],
                ['خرم آباد', 26], ['درب گنبد', 26], ['دورود', 26], ['زاغه', 26],
                ['سپیددشت', 26], ['سراب دوره', 26], ['شول آباد', 26], ['فیروزآباد', 26],
                ['کونانی', 26], ['کوهدشت', 26], ['گراب', 26], ['معمولان', 26],
                ['مؤمن آباد', 26], ['نورآباد', 26], ['ویسیان', 26], ['هفت چشمه', 26],
            ]);

        $this->insert('state', ['id' => 27, 'name' => 'مازندران']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['امیرکلا', 27], ['ایزدشهر', 27], ['آلاشت', 27], ['آمل', 27], ['بابل', 27],
                ['بابلسر', 27], ['بلده', 27], ['بهشهر', 27], ['بهنمیر', 27], ['پل سفید', 27],
                ['پول', 27], ['تنکابن', 27], ['جویبار', 27], ['چالوس', 27], ['چمستان', 27],
                ['خرم آباد', 27], ['خلیل شهر', 27], ['خوش رودپی', 27], ['دابودشت', 27],
                ['رامسر', 27], ['رستمکلا', 27], ['رویان', 27], ['رینه', 27], ['زرگر محله', 27],
                ['زیرآب', 27], ['ساری', 27], ['سرخرود', 27], ['سلمان شهر', 27], ['سورک', 27],
                ['شیرگاه', 27], ['شیرود', 27], ['عباس آباد', 27], ['فریدونکنار', 27], ['فریم', 27],
                ['قائم شهر', 27], ['کتالم  و سادات شهر', 27], ['کلارآباد', 27], ['کلاردشت', 27],
                ['کله بست', 27], ['کوهی خیل', 27], ['کیاسر', 27], ['کیاکلا', 27], ['گتاب', 27],
                ['گزنک', 27], ['گلوگاه', 27], ['محمودآباد', 27], ['مرزن آباد', 27],
                ['مرزیکلا', 27], ['نشتارود', 27], ['نکا', 27], ['نور', 27], ['نوشهر', 27],
            ]);

        $this->insert('state', ['id' => 28, 'name' => 'مرکزی']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['اراک', 28], ['آستانه', 28], ['آشتیان', 28], ['پرندک', 28], ['تفرش', 28],
                ['توره', 28], ['جاورسیان', 28], ['خشکرود', 28], ['خمین', 28], ['خنداب', 28],
                ['داودآباد', 28], ['دلیجان', 28], ['رازقان', 28], ['زاویه', 28], ['ساروق', 28],
                ['ساوه', 28], ['سنجان', 28], ['شازند', 28], ['شهر جدید مهاجران', 28],
                ['غرق آباد', 28], ['فرمهین', 28], ['قورچی باشی', 28], ['کرهرود', 28],
                ['کمیجان', 28], ['مأمونیه', 28], ['محلات', 28], ['میلاجرد', 28], ['نراق', 28],
                ['نوبران', 28], ['نیمور', 28], ['هندودر', 28],
            ]);

        $this->insert('state', ['id' => 29, 'name' => 'هرمزگان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ابوموسی', 29], ['بستک', 29], ['بندرجاسک', 29], ['بندرچارک', 29],
                ['بندرعباس', 29], ['بندرلنگه', 29], ['بیکاه', 29], ['پارسیان', 29], ['تخت', 29],
                ['جناح', 29], ['حاجی آباد', 29], ['خمیر', 29], ['درگهان', 29], ['دهبارز', 29],
                ['رویدر', 29], ['زیارتعلی', 29], ['سردشت  بشاگرد', 29], ['سرگز', 29],
                ['سندرک', 29], ['سوزا', 29], ['سیریک', 29], ['فارغان', 29], ['فین', 29],
                ['قشم', 29], ['قلعه قاضی', 29], ['کنگ', 29], ['کوشکنار', 29], ['کیش', 29],
                ['گوهران', 29], ['میناب', 29], ['هرمز', 29], ['هشتبندی', 29]
            ]);

        $this->insert('state', ['id' => 30, 'name' => 'همدان']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ازندریان', 30], ['اسدآباد', 30], ['برزول', 30], ['بهار', 30], ['تویسرکان', 30], ['جورقان', 30],
                ['جوکار', 30], ['دمق', 30], ['رزن', 30], ['زنگنه', 30], ['سامن', 30],
                ['سرکان', 30], ['شیرین سو', 30], ['صالح آباد', 30], ['فامنین', 30], ['فرسنج', 30],
                ['فیروزان', 30], ['قروه درجزین', 30], ['قهاوند', 30], ['کبودرآهنگ', 30],
                ['گل تپه', 30], ['گیان', 30], ['لالجین', 30], ['مریانج', 30], ['ملایر', 30],
                ['نهاوند', 30], ['همدان', 30],
            ]);

        $this->insert('state', ['id' => 31, 'name' => 'یزد']);

        $this->batchInsert('city', ['name', 'state_id'],
            [
                ['ابرکوه', 31], ['احمدآباد', 31], ['اردکان', 31], ['اشکذر', 31], ['بافق', 31],
                ['بفروئیه', 31], ['بهاباد', 31], ['تفت', 31], ['حمیدیا', 31], ['خضرآباد', 31],
                ['دیهوک', 31], ['زارچ', 31], ['شاهدیه', 31], ['طبس', 31], ['عشق آباد', 31],
                ['عقدا', 31], ['مروست', 31], ['مهردشت', 31], ['مهریز', 31], ['میبد', 31],
                ['ندوشن', 31], ['نیر', 31], ['هرات', 31], ['یزد', 31],
            ]);


    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo " m200104_144851_insert_category_state_city be reverted.\n";

        $this->delete('state');
        $this->delete('city');
        $this->delete('category');

        return true;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m200219_080609_insert_category_state_city cannot be reverted.\n";

        return false;
    }
    */

}
