<?php

use yii\helpers\Url;

/* @var $this yii\web\View */

$this->title = "املاک";
?>
<div>
    <div class="smartphone">
        <video autoplay muted loop >
            <?php $url =  Url::to("@web/video/housead.mp4"); ?>
            <source src="<?php echo $url ?>" type="video/mp4">
        </video>
    </div>
    <div class="desc">
        <h3>اپلیکیشن املاک</h3>
        <p>این اپلیکیشن پرسرعت و قابل انعطاف در خدمت شماست تا املاک مشتریان خود را با جزئیات کامل در معرض نمایش متقاضیان ملک قرار دهید</p>
        <p>کاربران می توانند با استفاده از فیلتر آیتم های متفاوت، ملک مورد نظر خود را جستجو نموده و با انتخاب هر ملک جزئیات را به همراه تصاویر مشاهده کنند و در صورت علاقه مندی با مشاور مربوط تماس برقرار کنند</p>
        <p> همچنین مدیران املاک می توانند اطلاعات جدید را از طریق سیستم ارسال اعلان (پوش نوتیفیکیشن) به کاربران منتقل کنند</p>
    </div>
</div>
